Revit 2024 API
ElementIsElementTypeFilter.PassesFilter Method
Overload List
Name | Description
PassesFilter(Element)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
See Also
ElementIsElementTypeFilter Class
ElementIsElementTypeFilter Members
Autodesk.Revit.DB Namespace